In [29]:
import pandas as pd
import numpy as np

In [3]:
labels=['a','b','c']
data=[1,2,3]

In [4]:
a=np.array(data)

In [5]:
d={'a':1,'b':2,'c':3}

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series(data=data)

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series(data=data,index=labels)

a    1
b    2
c    3
dtype: int64

In [9]:
pd.Series(data,labels)

a    1
b    2
c    3
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
series1=pd.Series(data=[1,2,3,4],index=['David','John','Aasha','victor'])

In [12]:
series1

David     1
John      2
Aasha     3
victor    4
dtype: int64

In [13]:
series2=pd.Series(data=[1,2,5,6],index=['David','John','Roger','Aasha'])

In [14]:
series2

David    1
John     2
Roger    5
Aasha    6
dtype: int64

In [15]:
#to extract element from series
series1["Aasha"]

3

In [16]:
series2["Roger"]

5

In [17]:
series1+series2
#pandas can only add series if the indexes are same
#if the indexes are same then it will only add values with same indexes

Aasha     9.0
David     2.0
John      4.0
Roger     NaN
victor    NaN
dtype: float64

# Pandas dataFrame

In [30]:
from numpy.random import randn

In [31]:
np.random.seed(10)

In [32]:
df=pd.DataFrame(randn(3,3),['a','b','c'],["x","y","z"])

In [33]:
df
#print dataframes

          x         y         z
a  1.331587  0.715279 -1.545400
b -0.008384  0.621336 -0.720086
c  0.265512  0.108549  0.004291

In [34]:
df['x']
#extracting column

a    1.331587
b   -0.008384
c    0.265512
Name: x, dtype: float64

In [35]:
type(df['x'])

pandas.core.series.Series

In [36]:
df[['y','z']]

          y         z
a  0.715279 -1.545400
b  0.621336 -0.720086
c  0.108549  0.004291

In [37]:
df.x

a    1.331587
b   -0.008384
c    0.265512
Name: x, dtype: float64

In [38]:
df['new']=df['x']+df['y']

In [39]:
df

          x         y         z       new
a  1.331587  0.715279 -1.545400  2.046865
b -0.008384  0.621336 -0.720086  0.612952
c  0.265512  0.108549  0.004291  0.374060

In [40]:
df.drop('new',axis=1)

          x         y         z
a  1.331587  0.715279 -1.545400
b -0.008384  0.621336 -0.720086
c  0.265512  0.108549  0.004291

In [41]:
df

          x         y         z       new
a  1.331587  0.715279 -1.545400  2.046865
b -0.008384  0.621336 -0.720086  0.612952
c  0.265512  0.108549  0.004291  0.374060

In [42]:
#for permanent changes in df use inplace
df.drop('new',axis=1,inplace=True)

In [43]:
df

          x         y         z
a  1.331587  0.715279 -1.545400
b -0.008384  0.621336 -0.720086
c  0.265512  0.108549  0.004291

In [35]:
#extracting rows from df
df.loc["a"]
#if we extract individual row or column from df it will shw it as a pandas series

x    1.331587
y    0.715279
z   -1.545400
Name: a, dtype: float64

In [36]:
df.iloc[1]
#i refers to index and loc means location

x   -0.008384
y    0.621336
z   -0.720086
Name: b, dtype: float64

In [38]:
#to extract one single element from dataframe
df.loc["b","y"]

0.6213359738904805

In [39]:
df.loc[["a","b"],['x','y']]
#to extract submatrix

          x         y
a  1.331587  0.715279
b -0.008384  0.621336

## Conditional Indexing

In [44]:
df=pd.DataFrame(randn(5,5),['a','b','c','d','e'],['v','w','x','y','z'])

In [45]:
df

          v         w         x         y         z
a -0.174600  0.433026  1.203037 -0.965066  1.028274
b  0.228630  0.445138 -1.136602  0.135137  1.484537
c -1.079805 -1.977728 -1.743372  0.266070  2.384967
d  1.123691  1.672622  0.099149  1.397996 -0.271248
e  0.613204 -0.267317 -0.549309  0.132708 -0.476142

In [46]:
df>0

       v      w      x      y      z
a  False   True   True  False   True
b   True   True  False   True   True
c  False  False  False   True   True
d   True   True   True   True  False
e   True  False  False   True  False

In [47]:
newdf=df>0

In [48]:
newdf

       v      w      x      y      z
a  False   True   True  False   True
b   True   True  False   True   True
c  False  False  False   True   True
d   True   True   True   True  False
e   True  False  False   True  False

In [49]:
df[newdf]
#comparing both dataframes

          v         w         x         y         z
a       NaN  0.433026  1.203037       NaN  1.028274
b  0.228630  0.445138       NaN  0.135137  1.484537
c       NaN       NaN       NaN  0.266070  2.384967
d  1.123691  1.672622  0.099149  1.397996       NaN
e  0.613204       NaN       NaN  0.132708       NaN

In [50]:
df[df>0]

          v         w         x         y         z
a       NaN  0.433026  1.203037       NaN  1.028274
b  0.228630  0.445138       NaN  0.135137  1.484537
c       NaN       NaN       NaN  0.266070  2.384967
d  1.123691  1.672622  0.099149  1.397996       NaN
e  0.613204       NaN       NaN  0.132708       NaN

In [51]:
df['x']>0

a     True
b    False
c    False
d     True
e    False
Name: x, dtype: bool

In [52]:
df['x']

a    1.203037
b   -1.136602
c   -1.743372
d    0.099149
e   -0.549309
Name: x, dtype: float64

In [53]:
df[df['x']>0]

          v         w         x         y         z
a -0.174600  0.433026  1.203037 -0.965066  1.028274
d  1.123691  1.672622  0.099149  1.397996 -0.271248

In [54]:
df['w']<0

a    False
b    False
c     True
d    False
e     True
Name: w, dtype: bool

In [62]:
df[df['w']<0]

          v         w         x         y         z
c -0.804591 -0.212698 -0.339140  0.312170  0.565153
d -0.147420 -0.025905  0.289094 -0.539879  0.708160

In [64]:
newdf=df[df['w']<0]

In [65]:
newdf

          v         w         x         y         z
c -0.804591 -0.212698 -0.339140  0.312170  0.565153
d -0.147420 -0.025905  0.289094 -0.539879  0.708160

In [67]:
newdf['x']

c   -0.339140
d    0.289094
Name: x, dtype: float64

In [68]:
df[df['x']<0]['w']

b    0.660232
c   -0.212698
Name: w, dtype: float64

In [73]:
#multiple conditions
#we cannot use pythons 'and' and 'or' operator we have to use'&' and '|'
df[(df['w']<0) & (df['y']<0)]

         v         w         x         y        z
d -0.14742 -0.025905  0.289094 -0.539879  0.70816

In [74]:
df["w"]<0

a    False
b    False
c     True
d     True
e    False
Name: w, dtype: bool

In [10]:
df

          x         y         z
a  1.331587  0.715279 -1.545400
b -0.008384  0.621336 -0.720086
c  0.265512  0.108549  0.004291

In [12]:
df.reset_index()

  index         x         y         z
0     a  1.331587  0.715279 -1.545400
1     b -0.008384  0.621336 -0.720086
2     c  0.265512  0.108549  0.004291

In [13]:
df
#to make permanant changes in the dataframe us inplace operator inplace=True

          x         y         z
a  1.331587  0.715279 -1.545400
b -0.008384  0.621336 -0.720086
c  0.265512  0.108549  0.004291

In [15]:
newind = "CA NY OR ".split()

In [16]:
"CA NY OR ".split()

['CA', 'NY', 'OR']

In [17]:
newind

['CA', 'NY', 'OR']

In [18]:
df["States"]=newind

In [19]:
df

          x         y         z States
a  1.331587  0.715279 -1.545400     CA
b -0.008384  0.621336 -0.720086     NY
c  0.265512  0.108549  0.004291     OR

In [20]:
df.set_index("States")

               x         y         z
States
CA      1.331587  0.715279 -1.545400
NY     -0.008384  0.621336 -0.720086
OR      0.265512  0.108549  0.004291

# Missing values

In [8]:
a={'a':[1,2,np.nan], "b":[4,np.nan,np.nan],"c":[1,2,3]}

In [10]:
df= pd.DataFrame(a)

In [11]:
df

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna()
#to delete nan in columns axis=1

     a    b  c
0  1.0  4.0  1

In [13]:
df.dropna(thresh=2)

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2

In [14]:
df.fillna(value="Fill Value")

            a           b  c
0         1.0         4.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [17]:
df["a"].fillna(value=df["a"].mean())
#we have replaced the last missing value with mean of the other two

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

# Group By
A groupby allows you to group together rows based off a column and then perform some sort of aggregate functio n on them.

In [4]:
import numpy as np
import pandas as pd

In [5]:
data={"company":["Google","Google","Microsoft","Mocrosoft","Facebook","Facebook"],
     "Person":["sam","Charlie","Amy","Vanessa","Carl","Sarah"],
     "Sales":[200,120,340,124,243,350]}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

     company   Person  Sales
0     Google      sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Mocrosoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [10]:
group=df.groupby("company")

In [11]:
group

In [13]:
group.mean()

           Sales
company
Facebook   296.5
Google     160.0
Microsoft  340.0
Mocrosoft  124.0

In [14]:
group.sum()

           Sales
company
Facebook     593
Google       320
Microsoft    340
Mocrosoft    124

In [15]:
group.std()

               Sales
company
Facebook   75.660426
Google     56.568542
Microsoft        NaN
Mocrosoft        NaN

In [16]:
group.std().loc["Facebook"]

Sales    75.660426
Name: Facebook, dtype: float64

In [18]:
df.groupby("company").sum()

           Sales
company
Facebook     593
Google       320
Microsoft    340
Mocrosoft    124

In [19]:
df.groupby("company").max()

            Person  Sales
company
Facebook     Sarah    350
Google         sam    200
Microsoft      Amy    340
Mocrosoft  Vanessa    124

In [20]:
df.groupby("company").count()

           Person  Sales
company
Facebook        2      2
Google          2      2
Microsoft       1      1
Mocrosoft       1      1

In [21]:
df.groupby("company").describe()

          Sales
          count   mean        std    min     25%    50%     75%    max
company
Facebook    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0
Mocrosoft   1.0  124.0        NaN  124.0  124.00  124.0  124.00  124.0

In [23]:
df.groupby("company").describe().transpose()
#to transpose  rows to columns and vicecersa

company        Facebook      Google  Microsoft  Mocrosoft
Sales count    2.000000    2.000000        1.0        1.0
      mean   296.500000  160.000000      340.0      124.0
      std     75.660426   56.568542        NaN        NaN
      min    243.000000  120.000000      340.0      124.0
      25%    269.750000  140.000000      340.0      124.0
      50%    296.500000  160.000000      340.0      124.0
      75%    323.250000  180.000000      340.0      124.0
      max    350.000000  200.000000      340.0      124.0

In [25]:
df.groupby("company").describe().transpose()["Facebook"]
#limiting it for particular company

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Facebook, dtype: float64

# Merging,Joining,and concatenating
there are 3 main ways of combining datag=frames together: merging, joining, and concatenating. in thus lecture we will discuss these 3 three methods with examples

## Example of dataframes

In [26]:
import pandas as pd

In [27]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index=[0,1,2,3])

In [28]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [29]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [30]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [31]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [32]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# concatenation
Concatenation basically glues together dataframes. keep in mind that the dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in the lisr of DataFarmes to concatenate together:

In [35]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [36]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Examples DataFrames

In [39]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [40]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [41]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merging
The merge function allows you to merge dataframes togethre using a similar logic as merging in SQL Tables together

In [42]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

or to show more complicated examples

In [43]:
left = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K0','K1'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                      'key2':['K0','K0','K0','K0'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [44]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

# Joining
Joining is a convinent method for combining the columns of two potentially differently-indexed dataframes into a single result dataframe.

In [47]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                   'B':['B0','B1','B2']},
                    index=['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C1','C2'],
                   'D':['D0','D1','D2']},
                    index=['K0','K1','K2'])

In [49]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [50]:
left.join(right,how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

# Some Important Pandas Operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.DataFrame({'col1':[1,2,3,4],"col2":[44,555,666,777],'col3':['abc','def','ghi','xyz']})

In [3]:
df.head()

   col1  col2 col3
0     1    44  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [4]:
df['col2'].unique()

#gives unique values in dataframe

array([ 44, 555, 666, 777], dtype=int64)

In [7]:
#what if you don't want output as an array and want the numbers of unique values
len(df['col2'].unique())
#or
df['col2'].nunique()

4

In [9]:
df['col1'].value_counts()

1    1
2    1
3    1
4    1
Name: col1, dtype: int64

In [14]:
#Apply function
#used for using custom funtion

def times2(x):
    return x*2

In [13]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
#there's no point of creating a function which we r going to use just once in the whole program. In that case use lambda
df["col1"].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
#to drop a column
#to make chnages permannant use inplace=True
df.drop("col1",axis=1)

   col2 col3
0    44  abc
1   555  def
2   666  ghi
3   777  xyz

In [19]:
#to extract all the column names from the dataframes
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [21]:
#this will extract the values that r there in our index
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df

   col1  col2 col3
0     1    44  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [24]:
#to sort values in dataframe in a particular order
df.sort_values("col2")

   col1  col2 col3
0     1    44  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [25]:
#to spot null values in the dataframe
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False